package com.simon.validate;

/**
 * 功能：完成输入邮箱格式的验证
 * 实现的功能：长度验证、地址符@的个数及位置验证、域操作符“.”的位置验证、首字符的验证
 * 
 * 遗留问题：本程序没有实现对地址中域名的检验和用户名的检验
 * 
 * 如果后期有具体的功能要求，可以对本程序进行改进
 * 
 * 作者：Jackeen Zhang
 * 时间：2011.06.22
 * 
 */
import java.util.Scanner;

public class isEMail {
	private static String eAdd;
	private static char[] e;
	
//-------------------------------------------------------------------------------------------------------
//定义验证方法
	static void check(String s){
		int m,c1=0,c2=0;
		int l = s.length();//获取邮箱地址长度
		e = new char[l];//创建字符数组
	//-------------------------------------------------------------------------------------------------------
		//进行地址长度检验，超过30位时报错退出
		if(l>30){
			System.out.println("输入错误，长度越界，请重新确认！");
			return;
		}
	//-------------------------------------------------------------------------------------------------------
		//将地址字符串转化成字符数组，并保存在e[l]中
		for(int i = 0;i<l;i++){
			e[i] = s.charAt(i);
		}
	//-------------------------------------------------------------------------------------------------------
		//实际验证过程
		//---------------------------------------------------------------------------------------------------
			//判断“@”和“.”的数量错误		
		for(int i = 0;i<l;i++){
			if(e[i]=='@'){
				c1++;//出现一次@，计数器c1加1
			}
			if(e[i]=='.'){
				c2++;//出现一次“.”，计数器c2加1
			}
		}
		if(c1!=1){//验证计数器c1的值是否为1，不为1则报错
			System.out.println("输入错误，字符”@“缺失或多余，请重新确认！");
			return;
		}
		if(c2==0){//如果计数器c2始终是0，则报错
			System.out.println("输入错误，”.“字符缺失，请重新确认！");
			return;
		}
		//---------------------------------------------------------------------------------------------------
			//验证地址符@的位置，若在首位或者后数前两位，则报错
		for(int i = 0;i<l;i++){
			if(e[i]=='@'){
				m = i;
				if(m==0||m>=l-3){
					System.out.println("输入错误，字符”@“位置有误，请重新确认！");
					return;
				}
			}
		}
		//---------------------------------------------------------------------------------------------------
			//验证域操作符“.”的位置，若在首位或末尾，则报错
		for(int i = 0;i<l;i++){
			if(e[i]=='.'){
				if(i==0||i==l-1){
					System.out.println("输入错误，字符”.“位置有误，请重新确认！");
					return;
				}
			}
		}	
		//---------------------------------------------------------------------------------------------------
			//验证首位，是否为非字母，若为非字母字符，则报错
		if(e[0]<'A'||(e[0]<'a'&&e[0]>'Z')||e[0]>'z'){
			System.out.println("输入错误，首位出现飞字母字符，请重新确认！");
			return;
		}
		
		
		//----------------------------------------------------------------------------------------------------
			//没有错误，通过验证
		System.out.println("恭喜您，您输入的E-mail地址符合规则要求！");
		
	}
//------------------------------------------------------------------------------------------------------------
	//主方法，程序入口，从控制台获取待验证的邮箱地址
	public static void main(String[] args){
		System.out.println("请输入E-mail地址：");
		Scanner se = new Scanner(System.in);				
		eAdd = se.next();
		check(eAdd);//调用Check方法，验证正确性
		se.close();
	}
}
